# Pandas (Ejercicios)

Utilice el archivo CSV para completar las tareas abajo mostradas.

** NOTA: REALICE TODAS LAS TAREAS EN UNA SOLA LINEA DE CODIGO **

** Importe pandas y lea el archivo banklist.csv en un dataframe llamado banks. **

** Muestre el head del dataframe **

In [26]:
# CODE HERE

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

** Cuales son los nombres de las columnas? **

In [ ]:
# CODE HERE

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

** Cuantos Estados (ST) estan presentes en el data set? **

In [ ]:
# CODE HERE

44

** Obtenga una lista de los arreglos de todos los estados en el data set. **

In [ ]:
# CODE HERE

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'], dtype=object)

** Cuales son los 5 primeros estados (Top 5) con m√°s bancos en quiebra? **

In [ ]:
# CODE HERE

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

** Cuales son las top 5 instituciones adquirientes de bancos? **

In [ ]:
# CODE HERE

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

** Cuantos bancos ha adquido el State Bank of Texas? Cuantos de ellos estan actualmente en Texas? **

In [ ]:
# CODE HERE

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

** Cual es la ciudad mas comun en Californoa para que un banco quebre **

In [ ]:
# CODE HERE

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

** Cuantos bancos quebrados no tienen el nombre "Bank" en su nombre comercial? **

In [ ]:
# CODE HERE

14

** Cuantos bancos inician su nombre comercial con la letra 's'? **

In [ ]:
# CODE HERE

53

** Cuantos valores CERT estan por debajo de 20000 ? **

In [61]:
# CODE HERE

417

** Cuantos nombres de banco estan compuestos por solo dos palabras? (e.g. "First Bank" , "Bank Georgia" )**

In [65]:
# CODE HERE

114

**Bonus: Cuantos bancos cerraron en el a√±o 2008? (esta es dificil porque utiliza Time Series! Investigue un poco... **

In [ ]:
# CODE HERE

25

# GREAT JOB!